[{"id":"http://zotero.org/users/4181482/items/G9DZUTDI","type":"article-journal","abstract":"Deep neural network (DNN)\n              models typically have many hyperparameters that can be configured to achieve optimal performance on a particular dataset. Practitioners usually tune the hyperparameters of their DNN models by training a number of trial models with different configurations of the hyperparameters, to find the optimal hyperparameter configuration that maximizes the training accuracy or minimizes the training loss. As such hyperparameter tuning usually focuses on the model accuracy or the loss function, it is not clear and remains under-explored how the process impacts other performance properties of DNN models, such as inference latency and model size. On the other hand, standard DNN models are often large in size and computing-intensive, prohibiting them from being directly deployed in resource-bounded environments such as mobile devices and\n              Internet of Things (IoT)\n              devices. To tackle this problem, various model optimization techniques (e.g., pruning or quantization) are proposed to make DNN models smaller and less computing-intensive so that they are better suited for resource-bounded environments. However, it is neither clear how the model optimization techniques impact other performance properties of DNN models such as inference latency and battery consumption, nor how the model optimization techniques impact the effect of hyperparameter tuning (i.e., the compounding effect). Therefore, in this paper, we perform a comprehensive study on four representative and widely-adopted DNN models, i.e.,\n              CNN image classification\n              ,\n              Resnet-50\n              ,\n              CNN text classification\n              , and\n              LSTM sentiment classification\n              , to investigate how different DNN model hyperparameters affect the standard DNN models, as well as how the hyperparameter tuning combined with model optimization affect the optimized DNN models, in terms of various performance properties (e.g., inference latency or battery consumption). Our empirical results indicate that tuning specific hyperparameters has heterogeneous impact on the performance of DNN models across different models and different performance properties. In particular, although the top tuned DNN models usually have very similar accuracy, they may have significantly different performance in terms of other aspects (e.g., inference latency). We also observe that model optimization has a confounding effect on the impact of hyperparameters on DNN model performance. For example, two sets of hyperparameters may result in standard models with similar performance but their performance may become significantly different after they are optimized and deployed on the mobile device. Our findings highlight that practitioners can benefit from paying attention to a variety of performance properties and the confounding effect of model optimization when tuning and optimizing their DNN models.","container-title":"ACM Transactions on Software Engineering and Methodology","DOI":"10.1145/3506695","ISSN":"1049-331X, 1557-7392","issue":"3","journalAbbreviation":"ACM Trans. Software Eng. Methodol.","language":"en-US","page":"1-40","source":"DOI.org (Crossref)","title":"An empirical study of the impact of hyperparameter tuning and model optimization on the performance properties of deep neural networks","URL":"https://dl.acm.org/doi/10.1145/3506695","volume":"31","author":[{"family":"Liao","given":"Lizhi"},{"family":"Li","given":"Heng"},{"family":"Shang","given":"Weiyi"},{"family":"Ma","given":"Lei"}],"accessed":{"date-parts":[["2025",11,15]]},"issued":{"date-parts":[["2022",7,31]]}},{"id":"http://zotero.org/users/4181482/items/TM46KX43","type":"article-journal","abstract":"Abstract\n            The complexity and heterogeneity of pore structure present significant challenges in accurate permeability estimation. Commonly used empirical formulas neglect its microscopic and topological characteristics, thus lacking accuracy and adaptability. While machine learning (ML) and deep learning (DL) models demonstrate promising performance, but encounter challenges of data availability, computational cost, and model interpretability. The present study aims to develop a more robust and accurate permeability prediction model via knowledge extraction from ML model. We first establish an ML model between permeability and the geometry‐topology characteristics of porous media using Extreme Gradient Boosting (XGBoost) algorithm. The data set used to fit ML model is prepared from 458 samples of different types of porous media. Using the SHapley Additive exPlanations (SHAP) value, the influence of each feature on permeability prediction is quantified. It is found that the closeness centrality (topology feature), tortuosity, porosity (macroscopic features) and throat diameter, throat length, pore diameter (pore network features) are vital for permeability prediction. Guided by partial dependence calculation, the unknown function relationship between permeability and the top six important features is established. The novel permeability prediction model incorporating topology feature improves the prediction accuracy and demonstrates strong applicability across diverse data sets. This new model presents an optimal balance between simplicity and performance, rendering it a compelling alternative for permeability prediction in porous media. The research provides a novel referable framework of knowledge extraction via ML to reveal the important features and establish the potential relationship that can be extended and applied in other research fields.\n          , \n            Key Points\n            \n              \n                \n                  A universal framework of knowledge extraction is provided to discover the important features and establish the unknown relationship\n                \n                \n                  Knowledge discovering based on machine learning helps to understand the prediction pattern and the impact of features on permeability\n                \n                \n                  The new model incorporating topology feature improves permeability prediction performance and demonstrates strong applicability","container-title":"Water Resources Research","DOI":"10.1029/2024WR037124","ISSN":"0043-1397, 1944-7973","issue":"7","journalAbbreviation":"Water Resour. Res.","language":"en-US","page":"e2024WR037124","source":"DOI.org (Crossref)","title":"Knowledge extraction via machine learning guides a topology‐based permeability prediction model","URL":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037124","volume":"60","author":[{"family":"Zhang","given":"Jia"},{"family":"Ma","given":"Gang"},{"family":"Yang","given":"Zhibing"},{"family":"Mei","given":"Jiangzhou"},{"family":"Zhang","given":"Daren"},{"family":"Zhou","given":"Wei"},{"family":"Chang","given":"Xiaolin"}],"accessed":{"date-parts":[["2025",11,15]]},"issued":{"date-parts":[["2024",7]]}},{"id":"http://zotero.org/users/4181482/items/HWANWN9W","type":"article-journal","abstract":"The steel industry serves as a cornerstone of a nation’s industrial system, with sintering playing a pivotal role in the steelmaking process. In an effort to enhance the intelligence of the sintering process and improve production efficiency, numerous scholars have carried out extensive research on data analysis and intelligent modeling techniques. These studies have made significant contributions to expanding production capacity, optimizing cost efficiency, and enhancing the quality of products, and supporting the sustainable development of the steel industry. This paper begins with an analysis of the sintering production process, explores the distinctive characteristics of the sintering process, and discusses the methods for identifying the operating conditions of sintering. It also provides an overview of the current state of research on both mechanism modeling and data-driven modeling approaches for the sintering process. Finally, the paper summarizes the existing challenges in sintering process modeling and offers perspectives on the future direction of research in this field.","container-title":"Processes","DOI":"10.3390/pr13010180","ISSN":"2227-9717","issue":"1","journalAbbreviation":"Processes","language":"en-US","page":"180","source":"DOI.org (Crossref)","title":"Review of intelligent modeling for sintering process under variable operating conditions","URL":"https://www.mdpi.com/2227-9717/13/1/180","volume":"13","author":[{"family":"Hu","given":"Jie"},{"family":"Li","given":"Hongxiang"},{"family":"Liu","given":"Junyong"},{"family":"Du","given":"Sheng"}],"accessed":{"date-parts":[["2025",11,15]]},"issued":{"date-parts":[["2025",1,10]]}},{"id":"http://zotero.org/users/4181482/items/YSQ94LSP","type":"thesis","abstract":"在钢铁生产过程中,高炉和烧结的粒度检测是不可或缺的环节,其运行效率和产品质量对整个生产链的顺畅运作至关重要。当前采用人工离线、低频的粒度筛分检测方法存在严重的时间滞后性,已无法满足钢铁企业高质量发展的需求,故实现粒度的在线识别是提升生产率和经济效益的重要基础。利用计算机视觉与深度学习技术相融合,构建铁前原燃料粒度及预警模型识别研究对推动钢铁可视化及智能化的发展具有重要的理论价值和现实意义。\n通过搭建铁前原燃料图像采集设备,对具有代表性的多批次烧结矿、焦炭、烧结混合料3种铁前原燃料采样,采用加权平均灰度处理、滤波降噪和直方图均衡化增强等技术进行了图像预处理,获得了构建铁前原燃料粒度识别模型所需的40000张512×512像素的原燃料图像基础数据集。构建了高炉原燃料粒度识别模型,对YOLACT++主干网络进行了改进,使用Det Net59替代了原有的Res Net101,并搭建了复合损失函数;该模型在准确率(PA)、召回率(Recall)、F1值和平均交并比(MIo U)等指标均达到90%以上;通过深度学习和3D点云的多模态融合有效解决了烧结矿孔隙误识别及过分割问题,提高了烧结矿粒度识别的准确性和稳定性。\n构建了Re-Unet烧结混合料粒度识别模型。通过对比分析了多种语义分割网络模型的优缺点,使用Unet网络为基础网络,通过跳连接方式优化网络结构降低特征损失,采用复合损失函数与自定义指标验证了模型的性能,应用可视化技术实现了烧结混合料粒度分布计算。结果表明输出结果与实际值误差小于2%,可用于对烧结混合料粒度的准确识别。\n构建了铁前粒度波动的预警模型。以烧结生产历史数据为基础,挖掘原燃料粒度合理分布范围。通过专家经验与算法划分粒度分布评价等级,设计了一套直观可视化的预警模型系统界面,以满足现场对烧结混合料、烧结矿粒度信息实时监测和预警的需求。\n图43幅;表7个;参100篇。","event-place":"唐山","genre":"硕士学位论文","language":"zh-CN","note":"original-author: HOU J C\noriginal-title: Research on Particle Size Recognition and Early Warning Model of Raw Materials and Fuels in Ironmaking Based on Deep Learning\noriginal-publisher: North China University of Science and Technology\noriginal-publisher-place: Tangshan","number-of-pages":"67","publisher":"华北理工大学","publisher-place":"唐山","source":"CNKI","title":"基于深度学习的铁前原燃料粒度识别及预警模型研究","URL":"https://doi.org/10.27108/d.cnki.ghelu.2024.000520","author":[{"literal":"侯炬才"}],"contributor":[{"literal":"李福民"},{"literal":"刘颂"},{"literal":"隋孝利"}],"accessed":{"date-parts":[["2025",11,15]]},"issued":{"date-parts":[["2025"]]}},{"id":"http://zotero.org/users/4181482/items/YQ6KYWY4","type":"article-journal","abstract":"合理的烧结混合料粒度分布是影响烧结矿产量和质量的重要因素.对具有代表性的多批次烧结混合料颗粒图像,采用加权平均灰度处理、滤波降噪和直方图均衡化增强等技术进行了图像预处理,获得了构建混合料粒度识别模型所需的基础数据集.选用5种评价指标,对比分析了Pspnet、Mask-Rcnn、Deeplabv3+、Unet等语义分割网络模型的准确性,确定使用Re-Unet网络构建了烧结混合料粒度识别模型.通过跳连接方式优化网络结构降低特征损失,采用复合损失函数与自定义指标验证了模型的性能,应用可视化技术实现了烧结混合料粒度分布计算.测试结果表明,模型的输出结果与实际值误差小于2％,可用于对烧结混合料粒度的精准识别.","container-title":"钢铁研究学报","DOI":"10.13228/j.boyuan.issn1001-0963.20230036","ISSN":"1001-0963","issue":"11","journalAbbreviation":"钢铁研究学报","language":"zh-CN","note":"original-author: LI F M\noriginal-author: HOU J C\noriginal-author: LIU S\noriginal-author: LIU R\noriginal-author: LIU L J\noriginal-author: LV Q\noriginal-title: Particle Size Recognition Model of Sintering Mixture Based on Computer Vision and Re-Unet Network\noriginal-container-title: Journal of Iron and Steel Research","page":"1347-1357","source":"Wanfang Data","title":"基于计算机视觉和Re-unet网络的烧结混合料粒度识别模型","URL":"https://d.wanfangdata.com.cn/periodical/gtyjxb202311005","volume":"35","author":[{"literal":"李福民"},{"literal":"侯炬才"},{"literal":"刘颂"},{"literal":"刘然"},{"literal":"刘连继"},{"literal":"吕庆"}],"accessed":{"date-parts":[["2025",11,15]]},"issued":{"date-parts":[["2023"]]}},{"id":"http://zotero.org/users/4181482/items/ZRDXZH55","type":"article-journal","abstract":"烧结过程中混合料配水的稳定控制对生产的稳定优质有至关重要的影响.本文基于烧结加水混料制粒的第一性原理,采用平均灰度处理、频率域法增强等技术进行了图像增强,利用Canny算子实现图像的边缘检测分割以及Halcon集合运算与区域变换算子进行处理,从而得到接近真实颗粒形态的轮廓特征,解决了混合料粒度识别的难题.通过试验对比发现试验物理筛分与图像识别结果两者偏差均在5%以内,基本可以表征混合料的整体特征;同时,验证了实时监测结果对加减水过程混合料粒度数据变化较为敏感,且对混合料加减水过程有很好的跟随性,为下一步基于混合料粒度识别的自动配水奠定了坚实基础.","container-title":"冶金标准化与质量","DOI":"10.3969/j.issn.1003-0514.2024.03.013","ISSN":"1003-0514","issue":"3","journalAbbreviation":"冶金标准化与质量","language":"zh-CN","note":"original-author: XU F F\noriginal-author: WANG H\noriginal-author: AN X W\noriginal-author: ZHANG T\noriginal-author: ZHAO H B\noriginal-author: LI Y J\noriginal-author: YUAN Z J\noriginal-title: Research and Application of Online Recognition of Sintering Mixture Particle Size\noriginal-container-title: Metallurgical Standardization and Quality","page":"50-56","source":"Wanfang Data","title":"烧结混合料粒度在线识别研究与应用","URL":"https://d.wanfangdata.com.cn/periodical/yjbzhyzl202403013","volume":"62","author":[{"literal":"续飞飞"},{"literal":"王晖"},{"literal":"安秀伟"},{"literal":"张涛"},{"literal":"赵宏博"},{"literal":"李永杰"},{"literal":"袁中洁"}],"accessed":{"date-parts":[["2025",11,15]]},"issued":{"date-parts":[["2024"]]}}]