[
	{
		"id": "Lakoff_2003_MetaphorsWeLive",
		"type": "book",
		"abstract": "People use metaphors every time they speak. Some of those metaphors are literary - devices for making thoughts more vivid or entertaining. But most are much more basic than that - they're \"metaphors we live by\", metaphors we use without even realizing we're using them. In this book, George Lakoff and Mark Johnson suggest that these basic metaphors not only affect the way we communicate ideas, but actually structure our perceptions and understandings from the beginning. Bringing together the perspectives of linguistics and philosophy, Lakoff and Johnson offer an intriguing and surprising guide to some of the most common metaphors and what they can tell us about the human mind. And for this new edition, they supply an afterword both extending their arguments and offering a fascinating overview of the current state of thinking on the subject of the metaphor.",
		"ISBN": "978-0-226-46801-3",
		"language": "en-US",
		"note": "price: US$16.00\nrating: 9.1\nratingPeople: 677人评价\ncomments: 238",
		"number-of-pages": "276",
		"publisher": "University Of Chicago Press",
		"source": "Douban",
		"title": "Metaphors We Live By",
		"URL": "https://book.douban.com/subject/1456266/",
		"author": [
			{
				"family": "Lakoff",
				"given": "George"
			},
			{
				"literal": "Mark Johnson"
			}
		],
		"accessed": {
			"date-parts": [
				[
					"2024",
					10,
					15
				]
			]
		},
		"issued": {
			"date-parts": [
				[
					"2003",
					4,
					15
				]
			]
		}
	},
    {
        "id": "O_2001_PsychoanalysisFilm",
        "type": "book",
        "abstract": "In full acknowledgment of the important cultural significance of film, this outstanding collection of psychoanalytic essays brings a methodological and theoretical sophistication to an absorbing range of film material. From Wild Strawberries and Vertigo to Titanic and Being John Malkovich, this intelligent and enjoyable collection succeedes in combining clarity and accessibility with a deeply informed scholarship.",
        "event-place": "London and New York",
        "ISBN": "978-1-85575-275-7",
        "language": "en",
        "number-of-pages": "239",
        "publisher": "KARNAC",
        "publisher-place": "London and New York",
        "source": "Douban",
        "title": "Psychoanalysis and Film",
        "URL": "https://book.douban.com/subject/10235832/",
        "editor": [
            {
                "family": "O",
                "given": "Gabbard Glen"
            }
        ],
        "accessed": {
            "date-parts": [
                [
                    "2023",
                    11,
                    28
                ]
            ]
        },
        "issued": {
            "date-parts": [
                [
                    "2001"
                ]
            ]
        }
    },
    {
        "id": "Beauvoir_1989_SecondSex",
        "type": "book",
        "abstract": "Newly translated and unabridged in English for the first time, Simone de Beauvoir’s masterwork is a powerful analysis of the Western notion of “woman,” and a groundbreaking exploration of inequality and otherness. This long-awaited new edition reinstates significant portions of the original French text that were cut in the first English translation. Vital and groundbreaking, Beauvoir’s pioneering and impressive text remains as pertinent today as it was sixty years ago, and will continue to provoke and inspire generations of men and women to come.",
        "ISBN": "978-0-679-72451-3",
        "language": "en-US",
        "note": "price: USD 17.95\nrating: 9.0\nratingPeople: 271人评价\ncomments: 57",
        "number-of-pages": "800",
        "publisher": "Vintage",
        "source": "Douban",
        "title": "The Second Sex",
        "URL": "https://book.douban.com/subject/1370716/",
        "author": [
            {
                "family": "Beauvoir",
                "given": "Simone",
                "dropping-particle": "de"
            }
        ],
        "translator": [
            {
                "family": "Parshley",
                "given": "H. M."
            }
        ],
        "accessed": {
            "date-parts": [
                [
                    "2024",
                    10,
                    15
                ]
            ]
        },
        "issued": {
            "date-parts": [
                [
                    "1989",
                    12,
                    17
                ]
            ]
        }
    },
    {
        "id": "Diamond_2001_NarratingdesiredesiringnarrationpsychoanalyticreadingEnglishPatient",
        "type": "chapter",
        "abstract": "The English Patient is about the reconstruction of Almasy's identity and life history, an account in which historical and narrative truth increasingly converge as he engages more and more deeply with significant objects in his life, both internal and external. In this zigzag movement from the private world of memory and desire to the creation of a shared consensual account, the narrative configurations of The English Patient to a certain extent parallel the process of narrative construction in analysis. The assumption of the anonymous identity of the English patient represents a screen narrative which incorporates aspects of the identities of lost others. Hana's willingness to become the co-explorer of the English patient's psychic space simultaneously reawakens his desire and fuels his desire for narration. Caravaggio poses a challenge to the shared narrative forged by Hana and Almasy, suggesting that the English patient may not be English at all, but instead Hungarian and a Nazi collaborator.",
        "container-title": "Psychoanalysis and Film",
        "event-place": "London",
        "language": "en-US",
        "page": "129-146",
        "publisher": "Routledge",
        "publisher-place": "London",
        "title": "Narrating desire and desiring narration: a psychoanalytic reading of The English Patient",
        "author": [
            {
                "family": "Diamond",
                "given": "Diana"
            }
        ],
        "issued": {
            "date-parts": [
                [
                    "2001"
                ]
            ]
        }
    },
    {
        "id": "Kreft_2020_CivilsocietyperspectivessexualviolenceconflictpatriarchywarstrategyColombia",
        "type": "article-journal",
        "abstract": "In international policy circles, conflict-related sexual violence (CRSV) is commonly viewed as a weapon of war, a framing that researchers have criticized as overly simplistic. Feminist scholars in particular caution that the ‘weapon of war’ framing decontextualizes sexual violence in conflict from the structural factors of gender inequality that underpin its perpetration. In light of these tensions, how do politically relevant local actors perceive the nature and the origins of conflict-related sexual violence? Civil society organizations often actively confront conflict-related sexual violence on the ground. A better understanding of how their perceptions of this violence align or clash with the globally dominant ‘weapon of war’ narratives therefore has important policy implications. Interviews with representatives of Colombian women's organizations and victims' associations reveal that these civil society activists predominantly view conflict-related sexual violence as the result of patriarchal structures. The mobilized women perceive sexual violence as a very gendered violence that exists on a continuum extending through peace, the everyday and war, and which the presence of arms exacerbates. Strategic sexual violence, too, is understood to ultimately have its basis in patriarchal structures. The findings expose a disconnect between the globally dominant ‘weapon of war’ understanding that is decontextualized from structural factors and a local approach to CRSV that establishes clear linkages to societal gender inequality.",
        "container-title": "International Affairs",
        "DOI": "10.1093/ia/iiz257",
        "ISSN": "0020-5850",
        "issue": "2",
        "journalAbbreviation": "Int. Aff.",
        "language": "en",
        "page": "457-478",
        "source": "Silverchair",
        "title": "Civil society perspectives on sexual violence in conflict: patriarchy and war strategy in Colombia",
        "title-short": "Civil society perspectives on sexual violence in conflict",
        "URL": "https://doi.org/10.1093/ia/iiz257",
        "volume": "96",
        "author": [
            {
                "family": "Kreft",
                "given": "Anne-Kathrin"
            }
        ],
        "accessed": {
            "date-parts": [
                [
                    "2024",
                    9,
                    4
                ]
            ]
        },
        "issued": {
            "date-parts": [
                [
                    "2020",
                    3,
                    1
                ]
            ]
        }
    }
]
