[
	{
		"id": "http://zotero.org/users/4181482/items/SFRXKXVL",
		"type": "thesis",
		"abstract": "黄顶菊[Flaveria bidentis (L.) Kuntze]是近年来发现的一种外来一年生草本植物,隶属菊科黄菊属。黄顶菊强大的繁殖能力和生存能力已使其成为一种潜在的入侵物种。本研究选取32个环境地理变量(包括气候、海拔等),结合黄顶菊在中国的分布记录,运用GARP、Maxent、ENFA、Bioclim和Domain五种生态位模型算法,通过模拟黄顶菊所需生态位,分析其在中国的适宜生境,从而模拟出黄顶菊在中国的潜在适生分布区域,并利用受试者工作特征曲线(ROC)比较不同模型模拟精度。得出的最佳模拟结果用于风险分析中国内适生范围(P44)的评判。根据PRA评估量化分析指标体系(五级标准)划定黄顶菊在我国的风险等级。研究结果包括：(1)采用多组训练数据和验证数据进行模型模拟,通过多组ROC曲线下面积(AUC)的统计分析比较,在稳定性上由高到低的排序是Maxent> Domain> GARP> ENFA> Bioclim, AUC最大值排序为Domain> Maxent> ENFA> GARP> Bioclim, AUC平均值排序为Maxent> Domain> ENFA> GARP> Bioclim,从这三个方面评定得出的最佳模型为Maxent;(2)最适合黄顶菊适生区分析的模型是Maxent模型,其预测高度适生区主要集中在华北和华东部分省市,包括河北中南部、北京、天津、山东西部和北部以及山东、河南、安徽、江苏四省的交界处；边缘以上适生区域则包括了河北中南部、北京、天津、山东、河南、安徽、江苏、湖北中部、四川东部以及云南中部地区；(3)通过Maxent模型中的刀切法分析,可以认为影响黄顶菊分布的五个主要生态地理环境因子是年平均温、温度变化方差、最暖季度平均湿度、海拔、5月份平均湿度,这也与黄顶菊实际分布情况相符合；(4)根据PRA评估量化分析指标体系得出黄顶菊在我国的风险等级为中度危险。结合黄顶菊在我国的适生分布,说明其入侵性并不是很强。但是在我国的河北大面积繁殖,对农业生产的影响很大,可能和其在河北缺少同生态位竞争生物有关。",
		"event-place": "南京",
		"genre": "硕士",
		"language": "zh-CN",
		"note": "page: 88-120",
		"publisher": "南京农业大学",
		"publisher-place": "南京",
		"source": "CNKI",
		"title": "外来入侵植物黄顶菊在中国潜在适生区预测及其风险评估",
		"URL": "https://chn.oversea.cnki.net/kcms/detail/detail.aspx?sfield=fn&QueryID=0&CurRec=1&FileName=1012268516.nh&DbName=CMFD2012&DbCode=CMFD",
		"author": [
			{
				"literal": "曹向锋"
			}
		],
		"accessed": {
			"date-parts": [["2023", 3, 20]]
		},
		"issued": {
			"date-parts": [["2010"]]
		}
	},
	{
		"id": "http://zotero.org/users/4181482/items/JDKVX9AJ",
		"type": "book",
		"event-place": "北京",
		"ISBN": "978-7-04-009129-8",
		"language": "zh-CN",
		"note": "page: 28-59",
		"number-of-pages": "336 页",
		"publisher": "高等教育出版社",
		"publisher-place": "北京",
		"source": "Douban",
		"title": "生物化学与分子生物学实验技术",
		"URL": "https://book.douban.com/subject/1545582/",
		"author": [
			{
				"family": "杨",
				"given": "安钢"
			},
			{
				"family": "毛",
				"given": "积芳"
			},
			{
				"family": "药",
				"given": "立波"
			}
		],
		"accessed": {
			"date-parts": [["2023", 3, 20]]
		},
		"issued": {
			"date-parts": [["2001", 1, 1]]
		}
	},
	{
		"id": "http://zotero.org/users/4181482/items/3WGDWQHH",
		"type": "article-journal",
		"abstract": "BACKGROUND: The availability of draft crop plant genomes allows the prediction of the full complement of genes that encode NB-LRR resistance gene homologs, enabling a more targeted breeding for disease resistance. Recently, we developed the RenSeq method to reannotate the full NB-LRR gene complement in potato and to identify novel sequences that were not picked up by the automated gene prediction software. Here, we established RenSeq on the reference genome of tomato (Solanum lycopersicum) Heinz 1706, using 260 previously identified NB-LRR genes in an updated Solanaceae RenSeq bait library.\nRESULT: Using 250-bp MiSeq reads after RenSeq on genomic DNA of Heinz 1706, we identified 105 novel NB-LRR sequences. Reannotation included the splitting of gene models, combination of partial genes to a longer sequence and closing of assembly gaps. Within the draft S. pimpinellifolium LA1589 genome, RenSeq enabled the annotation of 355 NB-LRR genes. The majority of these are however fragmented, with 5'- and 3'-end located on the edges of separate contigs. Phylogenetic analyses show a high conservation of all NB-LRR classes between Heinz 1706, LA1589 and the potato clone DM, suggesting that all sub-families were already present in the last common ancestor. A phylogenetic comparison to the Arabidopsis thaliana NB-LRR complement verifies the high conservation of the more ancient CCRPW8-type NB-LRRs. Use of RenSeq on cDNA from uninfected and late blight-infected tomato leaves allows the avoidance of sequence analysis of non-expressed paralogues.\nCONCLUSION: RenSeq is a promising method to facilitate analysis of plant resistance gene complements. The reannotated tomato NB-LRR complements, phylogenetic relationships and chromosomal locations provided in this paper will provide breeders and scientists with a useful tool to identify novel disease resistance traits. cDNA RenSeq enables for the first time next-gen sequencing approaches targeted to this very low-expressed gene family without the need for normalization.",
		"container-title": "BMC plant biology",
		"DOI": "10.1186/1471-2229-14-120",
		"ISSN": "1471-2229",
		"journalAbbreviation": "BMC plant biology",
		"language": "en-US",
		"note": "PMID: 24885638\nPMCID: PMC4036795\nJCR分区: Q1\n中科院分区升级版: 生物学2区\n中科院分区基础版: 生物3区\n影响因子: 5.26\n南农核心期: 无\n南农高质量期刊: 无",
		"page": "120",
		"source": "PubMed",
		"title": "Defining the full tomato NB-LRR resistance gene repertoire using genomic and cDNA RenSeq",
		"volume": "14",
		"author": [
			{
				"family": "Andolfo",
				"given": "Giuseppe"
			},
			{
				"family": "Jupe",
				"given": "Florian"
			},
			{
				"family": "Witek",
				"given": "Kamil"
			},
			{
				"family": "Etherington",
				"given": "Graham J."
			},
			{
				"family": "Ercolano",
				"given": "Maria R."
			},
			{
				"family": "Jones",
				"given": "Jonathan D. G."
			}
		],
		"issued": {
			"date-parts": [["2014", 5, 5]]
		}
	},
	{
		"id": "http://zotero.org/users/4181482/items/E6838YIU",
		"type": "article-journal",
		"abstract": "Plant cell walls are important barriers against microbial pathogens. Cell walls of Arabidopsis thaliana leaves contain three major types of polysaccharides: cellulose, various hemicelluloses, and pectins. UDP-D-galacturonic acid, the key building block of pectins, is produced from the precursor UDP-D-glucuronic acid by the action of glucuronate 4-epimerases (GAEs). Pseudomonas syringae pv maculicola ES4326 (Pma ES4326) repressed expression of GAE1 and GAE6 in Arabidopsis, and immunity to Pma ES4326 was compromised in gae6 and gae1 gae6 mutant plants. These plants had brittle leaves and cell walls of leaves had less galacturonic acid. Resistance to specific Botrytis cinerea isolates was also compromised in gae1 gae6 double mutant plants. Although oligogalacturonide (OG)-induced immune signaling was unaltered in gae1 gae6 mutant plants, immune signaling induced by a commercial pectinase, macerozyme, was reduced. Macerozyme treatment or infection with B. cinerea released less soluble uronic acid, likely reflecting fewer OGs, from gae1 gae6 cell walls than from wild-type Col-0. Although both OGs and macerozyme-induced immunity to B. cinerea in Col-0, only OGs also induced immunity in gae1 gae6. Pectin is thus an important contributor to plant immunity, and this is due at least in part to the induction of immune responses by soluble pectin, likely OGs, that are released during plant-pathogen interactions.",
		"container-title": "The Plant Cell",
		"DOI": "10.1105/tpc.15.00404",
		"ISSN": "1532-298X",
		"issue": "2",
		"journalAbbreviation": "Plant Cell",
		"language": "en-US",
		"note": "PMID: 26813622\nPMCID: PMC4790862\nJCR分区: Q1\n中科院分区升级版: 生物学1区\n中科院分区基础版: 生物1区\n影响因子: 12.09\n5年影响因子: 12.796\n南农核心期: 无\n南农高质量期刊: 无",
		"page": "537-556",
		"source": "PubMed",
		"title": "Pectin biosynthesis is critical for cell wall integrity and immunity in arabidopsis thaliana",
		"volume": "28",
		"author": [
			{
				"family": "Bethke",
				"given": "Gerit"
			},
			{
				"family": "Thao",
				"given": "Amanda"
			},
			{
				"family": "Xiong",
				"given": "Guangyan"
			},
			{
				"family": "Li",
				"given": "Baohua"
			},
			{
				"family": "Soltis",
				"given": "Nicole E."
			},
			{
				"family": "Hatsugai",
				"given": "Noriyuki"
			},
			{
				"family": "Hillmer",
				"given": "Rachel A."
			},
			{
				"family": "Katagiri",
				"given": "Fumiaki"
			},
			{
				"family": "Kliebenstein",
				"given": "Daniel J."
			},
			{
				"family": "Pauly",
				"given": "Markus"
			},
			{
				"family": "Glazebrook",
				"given": "Jane"
			}
		],
		"issued": {
			"date-parts": [["2016", 2]]
		}
	},
	{
		"id": "http://zotero.org/users/4181482/items/KRKU5VDI",
		"type": "article-journal",
		"abstract": "对国际上较知名的小麦生育期模型进行比较,为作物生育期模型的改进和完善提供参考。以CERES-Wheat、APSIMWheat、WheatGrow中的生育期子模型为对象,从阶段划分、参数设置、模型算法和模拟效果等方面对其进行比较分析。结果表明:在阶段划分上,CERES-Wheat和APSIM-Wheat均以累积热时间为尺度;WheatGrow以生理发育时间为尺度,并提出以茎顶端发育为主线预测生育期。参数设置上,WheatGrow模型较CERES-Wheat与APSIM-Wheat模型增加了基本早熟性和温度敏感性参数。模型算法上,CERES-Wheat和APSIM-Wheat均以折线型函数描述温度对发育速率的影响,WheatGrow则采用了正弦指数函数或余弦指数函数进行模拟;CERES-Wheat和APSIM-Wheat的春化效应因子是基于日平均温度的经验函数,而WheatGrow是基于日平均温度的3段函数;3个模型对光周期效应的模拟均采用二次函数。利用不同生态点、播期、密度和高温处理的试验资料对上述3个模型模拟的小麦开花期和成熟期进行了检验,结果显示:在正常环境条件下3个模型模拟值和预测值之间的均方根误差(RMSE)为1~2 d,但在生育后期极端高温条件下,3个模型对生育期的模拟效果均较差,RMSE为4~5 d。3个模型在正常环境条件下对小麦生育期模拟均较为准确,其中CERES-Wheat模型对成熟期的预测效果最好,WheatGrow模型对开花期的预测效果最好,但在极端高温下3个模型的模拟误差均较大,有待进一步改进和完善。",
		"container-title": "南京农业大学学报",
		"ISSN": "1000-2030",
		"issue": "1",
		"language": "zh-CN",
		"page": "6-14",
		"source": "CNKI",
		"title": "小麦生育期模拟模型的比较研究",
		"URL": "https://chn.oversea.cnki.net/kcms/detail/detail.aspx?sfield=fn&QueryID=0&CurRec=1&recid=&FileName=NJNY201401002&DbName=CJFD2014&DbCode=CJFD&yx=&pr=&URLID=",
		"volume": "37",
		"author": [
			{
				"literal": "杨月"
			},
			{
				"literal": "刘兵"
			},
			{
				"literal": "刘小军"
			},
			{
				"literal": "刘蕾蕾"
			},
			{
				"literal": "范雪梅"
			},
			{
				"literal": "曹卫星"
			},
			{
				"literal": "朱艳"
			}
		],
		"accessed": {
			"date-parts": [["2023", 3, 20]]
		},
		"issued": {
			"date-parts": [["2014"]]
		}
	}
]
